[{"text": "Hello am tile setter over 20 years experiencie in ceramic,porcelan,slate,travertine,marble,any tile,any works,kitchen,baths,floors,fireplaces,backsplash,shower pan repairs,new showers,free estimates,call Jesús#404-734-3010.thanks please only home owners."}, {"text": "National home improvement company seeks sales pros for a lucrative, rare opportunity. We advertise on TV and the Internet. We pre-qualify the customers who call in, and they are ready to buy.\n\nNO COLD CALLING\nNO DOOR KNOCKING\nNO PROSPECTING, PERIOD\n\nEvery day, you will be given up to 4 leads of people who are pre-qualified for credit and ready to buy. Just confirm an appointment with them, show up at their home, give the presentation, and close them! We're looking for hard-working sales pros for a full-time opportunity who can give a full-time commitment and can start right away. Sales pros must have their own reliable vehicle, a valid drivers license and auto insurance. Previous commission-based sales experience is preferred.\n\n\nWe Provide The Following:\n\nFree Training\nUp to 4 pre-qualified, ready to buy leads daily\nBonuses on top of commission\nGas reimbursement on your first 10 appointment to help get you started\nQualifications:\nMust start immediately after training\nReliable transportation and a smart phone\nValid drivers license and proof of auto insurance\nPrior commission-only sales experience\n\nTHE NUMBER OF POSITIONS ARE LIMITED, SO ACT NOW. For immediate consideration, call Mitchell at 706-263-2845"}, {"text": "Do you need a quality resume - Call Intelligent Solutions at 317-657-1402 or visit our website at www.myintelligentsolution.com."}, {"text": "Starts with a New Resume call Intelligent Solutions today\nPhone - 317-657-1402"}, {"text": "If your looking for a personal driver,company driver, I have a good driving record. I would use your vehicle, not  mine.\nNo felonies, never arrested.\nIm a trustworthy person. I can pass a background check, im reliable.  Prices depend on the Job\n      📞 (678) 334-9914"}, {"text": "Hi, My name is Madison Lee. I am 17 years old, A senior in high school. I am in Co-op, so I get out of school early at 1:20. So, I am looking for part time employment, from anything to a cashier somewhere or even babysitting! Just looking for a good paying job! I am hard working, trustworthy and dependent. I have a open mind when it comes to working, also I am not only looking for a job in Childersburg, other locations will work too! if interested, feel free to contact me on my cell (256)-744-4507. Thank you!"}, {"text": "Do you want to make new, innovative music?\nAre you searching for the perfect fit between creative and entertaining?\nDo you wish that you could find artists who were committed to the cause of music more than their own private interests?\n\nMy name is Jarrett and I am a musician who has been heavily influenced by progressive metal, blues, and folk music. I am looking for work in the Auburn-Opelika area or around Lee County. I want to create sounds that engage the audience artistically while also influencing them to dance and get their bodies moving.\n\nIf this sounds like it might be up your alley email or text/call at 334-663-0272"}, {"text": "Beautiful large Entertainment Center, Asking $150.00 or best offer. Great Sauder piece of furniture with new glass door/with extra hardware. Great for your sound system/Tv. If interested please call or text 315-237-8196. I realize this add reads Resumes/Job wanted but this is a piece of furniture that is ready to be sold."}, {"text": "I can assist you in starting a nonprofit organization or help current 501(c)(3) organizations by writing successful grant proposals and business plans. I also write grants for businesses which are for profit, however it really depends on what type of business you have.\n\n\nI am confident that I can help you! Contact me for a FREE quote on any of our services. I will also be happy to answer your questions related to the nonprofit grant writing process or any other services that I offer.\n\nVisit http://www.mmconsultants.net (Just click on the website link and you will be directed to my site).\n\nContact me today to get started at 770-602-4945"}]
